---

C#Visual BasicVisual C++

Revit 2024 API
---
RebarHostData..::..GetRebarHostData Method
RebarHostData Class See Also Send Feedback
---

Gets a RebarHostData object referring to the specified rebar host element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public static RebarHostData GetRebarHostData(
    	Element host
    )

Visual Basic
---

    Public Shared Function GetRebarHostData ( _
    	host As Element _
    ) As RebarHostData

Visual C++
---

    public:
    static RebarHostData^ GetRebarHostData(
    	Element^ host
    )

#### Parameters

host
    Type: Autodesk.Revit.DB..::..Element An element to host rebar.

#### Return Value

A RebarHostData object, or nullNothingnullptra null reference (Nothing in Visual Basic).

# Remarks

Returns nullNothingnullptra null reference (Nothing in Visual Basic) for elements that cannot ever be rebar hosts, such as levels.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also

RebarHostData Class

Autodesk.Revit.DB.Structure Namespace